app/Http/Controllers/PaymentController.php

select * from `gateways` where `status` = 1 and `gateways`.`id` = '36' limit 1
insert into `deposits` (`gateway_id`, `user_id`, `transaction_id`, `amount`, `rate`, `charge`, `final_amount`, `payment_status`, `payment_type`, `updated_at`, `created_at`) values (36, 169, 'XMUTCPGSD40DTIHJ', '300', '0.00000000', '1.00000000', 1, 0, 1, '2024-09-07 07:37:35', '2024-09-07 07:37:35')
---
    public function paynow(Request $request)
    {
        $request->validate([
            'amount' => 'required|gte:0',
        ]);

        $gateway = Gateway::where('status', 1)->findOrFail($request->id);
        $trx = strtoupper(Str::random());
        $final_amount = ($request->amount * $gateway->rate) + $gateway->charge;

        if (isset($request->type) && $request->type == 'deposit') {

            $deposit = Deposit::create([
                'gateway_id' => $gateway->id,
                'user_id' => auth()->id(),
                'transaction_id' => $trx,
                'amount' => $request->amount,
                'rate' => $gateway->rate,
                'charge' => $gateway->charge,
                'final_amount' => $final_amount,
                'payment_status' => 0,
                'payment_type' => 1,
            ]);