app/Http/Controllers/SiteController.php

select * from `pages` where `slug` = 'serviceWorker.js' limit 1
---
    public function page(Request $request)
    {

        $page = Page::where('slug', $request->pages)->first();

select * from `plans` where `status` = 1
---
    public function investmentPlan()
    {
        $pageTitle = "Investment Plan";
        $plans = Plan::where('status', 1)->get();

select * from `general_settings` limit 1
select * from `plans` where `plans`.`id` = '21' limit 1
select * from `times` where `times`.`id` in (8)
---
    public function investmentUsingBalannce(Request $request)
    {
        $request->validate([
            'amount' => 'required|numeric'
        ]);

        $general = GeneralSetting::first();

        $plan_id = Plan::with('time')->findOrFail($request->plan_id);

update `users` set `balance` = 990, `users`.`updated_at` = '2024-09-05 06:29:53' where `id` = 169
insert into `payments` (`plan_id`, `gateway_id`, `user_id`, `transaction_id`, `amount`, `rate`, `charge`, `final_amount`, `payment_status`, `next_payment_date`, `pair_price`, `pair_name`, `updated_at`, `created_at`) values (21, 0, 169, 'QS3PZOSLM62NK4LR', '10', 0, 0, '10', 1, '2024-09-06 06:29:53', '', '', '2024-09-05 06:29:53', '2024-09-05 06:29:53')
---
        }

        $user->balance = $user->balance - $request->amount;
        $user->save();

        $deposit = Payment::create([
            'plan_id' => $plan_id->id,
            'gateway_id' => 0,
            'user_id' => auth()->id(),
            'transaction_id' => $trx,
            'amount' => $request->amount,
            'rate' => 0,
            'charge' => 0,
            'final_amount' => $request->amount,
            'payment_status' => 1,
            'next_payment_date' => $next_payment_date,
            'pair_price' => $request->pair_price,
            'pair_name' => $request->pair_name,
        ]);

insert into `transactions` (`trx`, `gateway_id`, `amount`, `currency`, `details`, `charge`, `type`, `gateway_transaction`, `user_id`, `payment_status`, `updated_at`, `created_at`) values ('QS3PZOSLM62NK4LR', 0, '10', 'PKR', 'Payment Successfull', 0, '-', '', 169, 1, '2024-09-05 06:29:53', '2024-09-05 06:29:53')
---



        Transaction::create([
            'trx' => $deposit->transaction_id,
            'gateway_id' => $deposit->gateway_id,
            'amount' => $deposit->final_amount,
            'currency' => @$general->site_currency,
            'details' => 'Payment Successfull',
            'charge' => 0,
            'type' => '-',
            'gateway_transaction' => '',
            'user_id' => auth()->id(),
            'payment_status' => 1,
        ]);

select * from `payments` where `user_id` = 178 and `payment_status` = 1 limit 15 offset 0
select count(*) as aggregate from `payments` where `user_id` = 178 and `payment_status` = 1
---
    public function investLog(Request $request)
    {
        $pageTitle = 'Invest Log';

        $transactions = Payment::when($request->trx, function ($item) use ($request) {
            $item->where('transaction_id', $request->trx);
        })->when($request->date, function ($item) use ($request) {
            $item->whereDate('created_at', $request->date);
        })->where('user_id', auth()->id())->where('payment_status', 1)->paginate();