app/Http/Controllers/UserController.php

    public function dashboard()
    {

        $pageTitle = "Dashboard";
        $totalInvest = Payment::where('user_id', Auth::id())->where('payment_status', 1)->sum('amount');
        $currentInvest = Payment::where('user_id', Auth::id())
            ->where('payment_status', 1)
            ->where(
                'next_payment_date',
                '>=',
                now()
            )
            ->latest()
            ->first('amount');
        $currentPlan = Payment::with('plan')->where('user_id', Auth::id())->where('payment_status', 1)->latest()->first();
        $allPlan = Payment::with('plan')->where('user_id', Auth::id())->latest()->paginate(10, ['*'], 'plan');
        $withdraw = Withdraw::where('user_id', Auth::id())->where('status', 1)->sum('withdraw_amount');
        $interestLogs = UserInterest::with('payment')->where('user_id', Auth::id())->latest()->paginate(10, ['*'], 'log');

        $commison = RefferedCommission::where('reffered_by', Auth::id())->sum('amount');
        $currentDayCommision = RefferedCommission::where('reffered_by', Auth::id())->latest()->first('amount');
        $pendingInvest = Payment::where('user_id', Auth::id())->where('payment_status', 2)->sum('amount');
        $pendingWithdraw = Withdraw::where('user_id', Auth::id())->where('status', 0)->sum('withdraw_amount');
        $totalDeposit = Deposit::where('user_id', Auth::id())->where('payment_status', 1)->sum('final_amount');



        // perfomane chart work
        $LvlOneUsers = Db::table('users')
            ->select('id')
            ->where('reffered_by', Auth::id())
            ->where('status', 1) // Add this line
            ->pluck('id')
            ->toArray();


        $SumLvlOneDepositAmnt = DB::table('deposits')
            ->selectRaw('SUM(amount) AS total_amount')
            ->whereIn('user_id', $LvlOneUsers)
            ->where('payment_status', 1)
            ->first();

        $LvlTwoUsers = DB::table('users')
            ->select('id')
            ->whereIn('reffered_by', $LvlOneUsers)
            ->where('status', 1)
            ->pluck('id')
            ->toArray();

        $SumLvlTwoDepositAmnt = DB::table('deposits')
            ->selectRaw('SUM(amount) AS total_amount')
            ->whereIn('user_id', $LvlTwoUsers)
            ->where('payment_status', 1)
            ->first();

        $LvlThreeUsers = DB::table('users')
            ->select('id')
            ->whereIn('reffered_by', $LvlTwoUsers)
            ->where('status', 1)
            ->pluck('id')
            ->toArray();

        $SumLvlThreeDepositAmnt = DB::table('deposits')
            ->selectRaw('SUM(amount) AS total_amount')
            ->whereIn('user_id', $LvlThreeUsers)
            ->where('payment_status', 1)
            ->first();


        $SumLvlOneComAmnt = DB::table('reffered_commissions')
            ->selectRaw('SUM(amount) AS total_com')
            ->whereIn('reffered_to', $LvlOneUsers)
            ->first();
        $SumLvlTwoComAmnt = DB::table('reffered_commissions')
            ->selectRaw('SUM(amount) AS total_com')
            ->whereIn('reffered_to', $LvlTwoUsers)
            ->first();
        $SumLvlThreeComAmnt = DB::table('reffered_commissions')
            ->selectRaw('SUM(amount) AS total_com')
            ->whereIn('reffered_to', $LvlThreeUsers)
            ->first();
---
select sum(`amount`) as aggregate from `payments` where `user_id` = 169 and `payment_status` = 1
select sum(`amount`) as aggregate from `payments` where `user_id` = 175 and `payment_status` = 1
select `amount` from `payments` where `user_id` = 169 and `payment_status` = 1 and `next_payment_date` >= '2024-09-09 16:51:17' order by `created_at` desc limit 1
select * from `payments` where `user_id` = 169 and `payment_status` = 1 order by `created_at` desc limit 1
select * from `plans` where `plans`.`id` in (17)
select * from `payments` where `user_id` = 169 order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `payments` where `user_id` = 169
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` = 169 and `status` = 1
select count(*) as aggregate from `payments` where `user_id` = 175
select * from `payments` where `payments`.`id` in (137, 138, 139, 142, 143, 144)
select * from `user_interests` where `user_id` = 169 order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `user_interests` where `user_id` = 169
select sum(`amount`) as aggregate from `reffered_commissions` where `reffered_by` = 169
select `amount` from `reffered_commissions` where `reffered_by` = 169 order by `created_at` desc limit 1
select sum(`amount`) as aggregate from `reffered_commissions` where `reffered_by` = 175
select sum(`amount`) as aggregate from `payments` where `user_id` = 169 and `payment_status` = 2
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` = 169 and `status` = 0
select sum(`final_amount`) as aggregate from `deposits` where `user_id` = 169 and `payment_status` = 1
select `id` from `users` where `reffered_by` = 175 and `status` = 1
select SUM(amount) AS total_amount from `deposits` where `user_id` in (170) and `payment_status` = 1 limit 1
select `id` from `users` where `reffered_by` in (170) and `status` = 1
select SUM(amount) AS total_amount from `deposits` where `user_id` in (172) and `payment_status` = 1 limit 1
select `id` from `users` where `reffered_by` in (172) and `status` = 1
select SUM(amount) AS total_amount from `deposits` where `user_id` in (174) and `payment_status` = 1 limit 1
select SUM(amount) AS total_com from `reffered_commissions` where `reffered_to` in (170) limit 1
select SUM(amount) AS total_com from `reffered_commissions` where `reffered_to` in (172) limit 1
select SUM(amount) AS total_com from `reffered_commissions` where `reffered_to` in (174) limit 1

        // perfomane chart work

        // vip work
        $user = User::find(Auth::id());
        $general = GeneralSetting::first();
---
select * from `users` where `users`.`id` = 169 limit 1
select * from `general_settings` limit 1

                $requiredUsers = $general["req_active_users_vip$i"];

                // Count the actual active users referred by the current user
                $getActiveUsers = User::where('reffered_by', $user->id)
                    ->where('status', 1) // Filter for active users
                    ->count();
---
select count(*) as aggregate from `users` where `reffered_by` = 169 and `status` = 1



        // vip work
        $plans = Plan::where('status', 1)->get();
        $today_deposit_amount = DB::table('deposits')
            ->where('user_id', Auth::id())
            ->where('payment_status', 1)
            ->whereDate('created_at', Carbon::today())
            ->sum('amount');
        $today_withdraw_amount = DB::table('withdraws')
            ->where('user_id', Auth::id())
            ->where('status', 1)
            ->whereDate('created_at', Carbon::today())
            ->sum('withdraw_amount');
        $uplainer_id = DB::table('users')->where('id', auth()->id())->value('reffered_by');
        $uplainer_name = DB::table('users')->where('id', $uplainer_id)->first(['fname', 'lname']);
---
select * from `plans` where `status` = 1
select sum(`amount`) as aggregate from `deposits` where `user_id` = 169 and `payment_status` = 1 and date(`created_at`) = '2024-09-09'
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` = 169 and `status` = 1 and date(`created_at`) = '2024-09-09'
select `reffered_by` from `users` where `id` = 169 limit 1
select `fname`, `lname` from `users` where `id` = '168' limit 1

    public function withdraw()
    {
        $pageTitle = 'Withdraw Money';

        $withdraws = WithdrawGateway::where('status', 1)->latest()->get();
---
select * from `withdraw_gateways` where `status` = 1 order by `created_at` desc

    public function returnInterest()
    {
        $general = GeneralSetting::first();
        $invests = Payment::with('plan', 'user')->where('payment_status', 1)->latest()->get();
---
select * from `general_settings` limit 1
select * from `payments` where `payment_status` = 1 order by `created_at` desc
select * from `plans` where `plans`.`id` in (17, 21)
select * from `users` where `users`.`id` in (170, 175)

                        }

                        //paymentupdate on next date
                        $updatePayment = Payment::where('plan_id', $invest->plan_id)->where('next_payment_date', $invest->next_payment_date)->first();

                        $count = Payment::where('plan_id', $invest->plan_id)->where('next_payment_date', $invest->next_payment_date)->sum('pay_count');
---
select * from `payments` where `plan_id` = 21 and `next_payment_date` = '2024-09-05 06:20:37' limit 1
select sum(`pay_count`) as aggregate from `payments` where `plan_id` = 21 and `next_payment_date` = '2024-09-05 06:20:37'

                                $updatePayment->interest_amount += $interestAmount;
                                $updatePayment->pay_count += 1;

                                UserInterest::create([
                                    'user_id' => $user->id,
                                    'payment_id' => $invest->id,
                                    'interest_amount' => $interestAmount,
                                    'purpouse' => 'Invest Return Commission'
                                ]);
---
insert into `user_interests` (`user_id`, `payment_id`, `interest_amount`, `purpouse`, `updated_at`, `created_at`) values (175, 136, 0.2, 'Invest Return Commission', '2024-09-05 06:21:15', '2024-09-05 06:21:15')

                                    'currency' => @$general->site_currency
                                ], $invest->user);

                                $updatePayment->save();
                                $user->save();
---
update `payments` set `next_payment_date` = '2024-09-06 06:20:37', `interest_amount` = 0.2, `pay_count` = 1, `payments`.`updated_at` = '2024-09-05 06:21:17' where `id` = 136
update `users` set `balance` = 9990.2, `users`.`updated_at` = '2024-09-05 06:21:17' where `id` = 175


                                if ($updatePayment->pay_count == $invest->plan->how_many_time) {
                                    $updatePayment->next_payment_date = null;
                                    $updatePayment->save();
---
update `payments` set `next_payment_date` = '', `payments`.`updated_at` = '2024-09-05 06:21:17' where `id` = 136

                                        $updatePayment->next_payment_date = null;
                                        $updatePayment->pay_count = null;
                                        $updatePayment->save();
                                        $user->save();

                                        Transaction::create([
                                            'trx' => strtoupper(Str::random(16)),
                                            'gateway_id' => 0,
                                            'amount' => $invest->amount,
                                            'currency' => @$general->site_currency,
                                            'details' => 'Capital Back For Plan ' . $invest->plan->plan_name,
                                            'charge' => 0,
                                            'type' => '+',
                                            'gateway_transaction' => '',
                                            'user_id' => $user->id,
                                            'payment_status' => 1
                                        ]);
---
update `users` set `balance` = 10000.2, `users`.`updated_at` = '2024-09-05 06:21:17' where `id` = 175
insert into `transactions` (`trx`, `gateway_id`, `amount`, `currency`, `details`, `charge`, `type`, `gateway_transaction`, `user_id`, `payment_status`, `updated_at`, `created_at`) values ('IMWNGONUV4NIE1IR', 0, '10.00000000', 'PKR', 'Capital Back For Plan test', 0, '+', '', 175, 1, '2024-09-05 06:21:17', '2024-09-05 06:21:17')