app/Http/Controllers/Admin/ManageGatewayController.php

select * from `deposits` where `transaction_id` = 'DROU63NAO5STGWCF' limit 1
select * from `general_settings` limit 1
select * from `gateways` where `gateway_name` = 'USDT' limit 1
update `users` set `balance` = 6500.6, `users`.`updated_at` = '2024-09-06 12:54:05' where `id` = 169
insert into `transactions` (`trx`, `gateway_id`, `amount`, `currency`, `details`, `charge`, `type`, `user_id`, `payment_status`, `updated_at`, `created_at`) values ('DROU63NAO5STGWCF', 36, '5500.00000000', 'PKR', 'Payment Successfull', 1, '-', 169, 1, '2024-09-06 12:54:05', '2024-09-06 12:54:05')
select `reffered_by` from `users` where `id` = 169 and `status` = 1 limit 1
select `reffered_by` from `users` where `id` = 168 and `status` = 1 limit 1
select `reffered_by` from `users` where `id` = 0 and `status` = 1 limit 1
---
    public function depositAccept(Request $request)
    {
        $booking = Deposit::where('transaction_id', $request->trx)->firstOrFail();
        $general = GeneralSetting::first();
        $gateway = Gateway::where('gateway_name', 'USDT')->first();
        if ($gateway) {
            $charge = $gateway->charge ?? 1; // Use gateway's charge if available, otherwise fallback to 1
        } else {
            // Handle the error when $gateway is null
            $charge = 1; // Or throw an exception or handle accordingly
        }


        $booking->payment_status = 1;
        $booking->user->balance = $booking->user->balance + $booking->amount;
        $booking->save();
        $booking->user->save();
        Transaction::create([
            'trx' => $booking->transaction_id,
            'gateway_id' => $booking->gateway_id,
            'amount' => $booking->amount,
            'currency' => $general->site_currency,
            'details' => 'Payment Successfull',
            'charge' => $charge,
            'type' => '-',
            'user_id' => $booking->user_id,
            'payment_status' => 1
        ]);
        $general = GeneralSetting::first();

        $checkuplainerlvl1 = (int) DB::table('users')
            ->where('id', $booking->user_id)
            ->where('status', 1)
            ->value('reffered_by');

        $checkuplainerlvl2 = (int) DB::table('users')
            ->where('id', $checkuplainerlvl1)
            ->where('status', 1)
            ->value('reffered_by');

        $checkuplainerlvl3 = (int) DB::table('users')
            ->where('id', $checkuplainerlvl2)
            ->where('status', 1)
            ->value('reffered_by');

        $checkuplainerlvl4 = (int) DB::table('users')
            ->where('id', $checkuplainerlvl3)
            ->where('status', 1)
            ->value('reffered_by');

        $checkuplainerlvl5 = (int) DB::table('users')
            ->where('id', $checkuplainerlvl4)
            ->where('status', 1)
            ->value('reffered_by');