app/Http/Controllers/Admin/PlanController.php

    public function index()
    {
        $pageTitle = 'All Plans';

        $plans = Plan::latest()->paginate();
---
select * from `plans` order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `plans`